let hello = "   Hello, World!  ";
let wsRegex = /^\s+|\s+$/g; // Змініть цей рядок
let result = hello.replace(wsRegex, ''); // Змініть цей рядок

console.log(result);



// { } специфікатори кількості {3,5} від 3 до 5, {3,} від 3, {3} лише 3, {ar?} ел. перед ? відсутній або необовʼязковий
// * шукати 0 чи більше символів
// + шукати один чи більше символів
// \s знайти пробіли
// \S знайти усі символи окрім пробілів
// (?=...) позитивний перегляд виконуватиме пошук, щоб переконатись, що елемент з шаблону пошуку існує
// (?!=...) негативний перегляд виконує пошук, щоб переконатись, що елемент з шаблону пошуку не існує
// (a|b) можливість пошуку або